HopeFOAM-0.1/tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoom/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    box
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
}

// ************************************************************************* //
